W7D1-Project/cats_phase_4/app/models/cat_rental_request.rb

  def approve!
    raise 'not pending' unless self.status == 'PENDING'

    transaction do
      self.status = 'APPROVED'
      self.save!

      # When you approve this request, you reject all other overlapping
      # requests for this cat.
      overlapping_pending_requests.each do |req|
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2023-02-20 19:48:49.778565"], ["id", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2023-02-23' OR end_date < '2023-02-20') AND (status = 'PENDING')  [["id", 1], ["cat_id", 1]]

  def does_not_overlap_approved_request
    # A denied request doesn't need to be checked. A pending request
    # should be checked; users shouldn't be able to make requests for
    # periods during which a cat has already been spoken for.
    return if self.denied? || overlapping_approved_requests.empty?
---
SELECT 1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2023-02-23' OR end_date < '2023-02-20') AND (status = 'APPROVED') LIMIT $3  [["id", 1], ["cat_id", 1], ["LIMIT", 1]]