W7D1-Project/cats_phase_4/app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def generate_unique_session_token
    token = SecureRandom::urlsafe_base64
    while user.exists?(session_token: token)