W7D1-Project/cats_phase_4/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
      <option selected disabled>--Select Cat--</option>
      <% Cat.all.each do |cat| %>